// English
export const alphabetENG = 
[
    "Aa", "Bb", "Cc", "Dd", "Ee", "Ff",
    "Gg", "Hh", "Ii", "Jj", "Kk", "Ll",
    "Mm", "Nn", "Oo", "Pp", "Qq", "Rr",
    "Ss", "Tt", "Uu", "Vv", "Ww", "Xx",
    "Yy", "Zz",
];

// Greek
export const alphabetGRE = 
[
    "Αα", "Ββ", "Γγ", "Δδ", "Εε", "Ζζ",
    "Ηη", "Θθ", "Ιι", "Κκ", "Λλ", "Μμ",
    "Νν", "Ξξ", "Οο", "Ππ", "Ρρ", "Σσ,ς",
    "Ττ", "Υυ", "Φφ", "Χχ", "Ψψ", "Ωω",
];

// Korean
export const alphabetKOR = 
[
    "", "", "", "", "", "",
];

// Japanese
export const alphabetJPN = 
[
    "あア", "いイ", "うウ", "えエ", "おオ",
    "かカ", "きキ", "くク", "けケ", "こコ",
    "さサ", "しシ", "すス", "せセ", "そソ",
    "たタ", "ちチ", "つツ", "てテ", "とト",
    "なナ", "にニ", "ぬヌ", "ねネ", "のノ",
    "はハ", "ひヒ", "ふフ", "へヘ", "ほホ",
    "まマ", "みミ", "むム", "めメ", "もモ",
    "やヤ", "※", "ゆユ", "※", "よヨ",
    "らラ", "りリ", "るル", "れレ", "ろロ",
    "わワ", "ゐヰ", "※", "ゑヱ", "をヲ",
    "んン", 

    "がガ", "ぎギ", "ぐグ", "げゲ", "ごゴ",
    "ざザ", "じジ", "ずズ", "ぜゼ", "ぞゾ",
    "だダ", "ぢヂ", "づヅ", "でデ", "どド",
    "ばバ", "びビ", "ぶブ", "べベ", "ぼボ",
    "ぱパ", "ぴピ", "ぷプ", "ぺペ", "ぽポ",
    "か゚カ゚", "き゚キ゚", "く゚ク゚", "け゚ケ゚", "こ゚コ゚",

    "きゃ", "きゅ", "きょ",
    "しゃ", "しゅ", "しょ",
    "ちゃ", "ちゅ", "ちょ",
    "にゃ", "にゅ", "にょ",
    "ひゃ", "ひゅ", "ひょ",
    "みゃ", "みゅ", "みょ",
    "りゃ", "りゅ", "りょ",

    "ぎゃ", "ぎゅ", "ぎょ",
    "じゃ", "じゅ", "じょ",
    "びゃ", "びゅ", "びょ",
    "ぴゃ", "ぴゅ", "ぴょ",
    "き゚ゃ", "き゚ゅ", "き゚ょ",
];

// Russian
export const alphabetRUS = 
[
    "Aa", "Бб", "Вв", "Гг", "Дд", "Ее",
    "Ёё", "Жж", "Зз", "Ии", "Йй", "Кк",
    "Лл", "Мм", "Нн", "Оо", "Пп", "Рр",
    "Сс", "Тт", "Уу", "Фф", "Хх", "Xx",
    "Цц", "Чч", "Шш", "Щщ", "ъ", "ы",
    "ь", "Ээ", "Юю", "Яя",
];
